* Widely used library for data analysis
* Provided 2 primary data structures - Series and DataFrame
* Series is One Dimensional & DataFrame is 2 dimensional

In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\prasanna-insyncai\appdata\local\programs\python\python312\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\prasanna-insyncai\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\prasanna-insyncai\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\prasanna-insyncai\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\prasanna-insyncai\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\prasanna-insyncai\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: C:\Users\Prasanna-InsyncAI\AppData\Local\Programs\Python\Python312\python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [4]:
# Series

data = [1,2,3,4,5]
series = pd.Series(data)
print('Series \n', series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
# Create dictionary from a dictionary
data = {'a': 1, 'b': 2, 'c': 3}

series_dict = pd.Series(data)
series_dict

a    1
b    2
c    3
dtype: int64

In [6]:
data = [10, 20, 30]
index = ['a','b','c']

pd.Series(data=data, index=index)

a    10
b    20
c    30
dtype: int64

In [7]:
## Data Frame
## Create a dataframe from dictionary from list

data = {
    'Name': ['Krish', 'John', 'Jack'],
    'age' : [20, 30, 50], 
    'city': ['Bangalore', 'Chennai', 'Kolkata']
}

df_data = pd.DataFrame(data)
df_data

    Name  age       city
0  Krish   20  Bangalore
1   John   30    Chennai
2   Jack   50    Kolkata

In [13]:
#create a dataframe from list of dictionaries

data = [
    {'Name': 'Krish', 'age' : 20, 'city': 'Bangalore'}, 
    {'Name': 'Kp', 'age' : 60, 'city': 'Bangalore'}
    ]

df_list_dic = pd.DataFrame(data)
df_list_dic

    Name  age       city
0  Krish   20  Bangalore
1     Kp   60  Bangalore

In [14]:
bank_churn_data = pd.read_csv('Bank_Churn.csv', encoding='utf-8')

In [15]:
bank_churn_data.head(5)

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [17]:
bank_churn_data.tail(5)

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
9995,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [18]:
## Data Frame
## Create a dataframe from dictionary from list

data = {
    'Name': ['Krish', 'John', 'Jack'],
    'age' : [20, 30, 50], 
    'city': ['Bangalore', 'Chennai', 'Kolkata']
}

df_data = pd.DataFrame(data)
df_data

    Name  age       city
0  Krish   20  Bangalore
1   John   30    Chennai
2   Jack   50    Kolkata

In [21]:
df_data['Name']

0    Krish
1     John
2     Jack
Name: Name, dtype: object

In [23]:
df_data.loc[0]

Name        Krish
age            20
city    Bangalore
Name: 0, dtype: object

In [24]:
df_data.iloc[0]

Name        Krish
age            20
city    Bangalore
Name: 0, dtype: object

In [26]:
## Accessing a specified element
# df_data['Name']
df_data

    Name  age       city
0  Krish   20  Bangalore
1   John   30    Chennai
2   Jack   50    Kolkata

In [28]:
df_data.at[1, 'age']

np.int64(30)

In [29]:
df_data.at[2, 'city']

'Kolkata'

In [30]:
## Accessing specific element at iat
df_data

    Name  age       city
0  Krish   20  Bangalore
1   John   30    Chennai
2   Jack   50    Kolkata

In [31]:
df_data.iat[2,2]

'Kolkata'

In [32]:
# Data manipulation
df_data

    Name  age       city
0  Krish   20  Bangalore
1   John   30    Chennai
2   Jack   50    Kolkata

In [33]:
# Adding column
df_data['salary'] = [5000, 6000, 7000]

In [34]:
df_data

    Name  age       city  salary
0  Krish   20  Bangalore    5000
1   John   30    Chennai    6000
2   Jack   50    Kolkata    7000

In [44]:
# Dropping column
df_data.drop('salary', axis=1, inplace=True)

In [45]:
df_data

    Name  age       city
0  Krish   20  Bangalore
1   John   30    Chennai
2   Jack   50    Kolkata

In [46]:
## add age to the column

df_data['age'] = df_data['age'] + 1

In [47]:
df_data

    Name  age       city
0  Krish   21  Bangalore
1   John   31    Chennai
2   Jack   51    Kolkata

In [50]:
df_data.drop(0, inplace=True)

In [51]:
df_data

   Name  age     city
1  John   31  Chennai
2  Jack   51  Kolkata

In [52]:
bank_churn_data.describe()

,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,1.000000e+04,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000
mean,1.569094e+07,650.528800,38.921800,5.012800,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700
std,7.193619e+04,96.653299,10.487806,2.892174,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769
min,1.556570e+07,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000
25%,1.562853e+07,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000
50%,1.569074e+07,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000
75%,1.575323e+07,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000
max,1.581569e+07,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000

In [53]:
bank_churn_data.dtypes

CustomerId           int64
Surname             object
CreditScore          int64
Geography           object
Gender              object
Age                  int64
Tenure               int64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
Exited               int64
dtype: object